tap "aws/tap"
tap "gigalixir/brew"
tap "hamler-lang/hamler"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "local/brew"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "readline"
brew "git"
brew "asdf"
brew "autoconf"
brew "awscli"
brew "carthage"
brew "clang-format"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "diskonaut"
brew "doxygen"
brew "exercism"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "forego"
brew "fswatch"
brew "gawk"
brew "npth"
brew "gnupg"
brew "pkgconf"
brew "libtool"
brew "gh"
brew "gifsicle"
brew "gnu-sed"
brew "gradle"
brew "graphviz"
brew "gtk+3"
brew "huggingface-cli"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "just"
brew "macvim"
brew "opam"
brew "openssl@1.1"
brew "pcre"
brew "pipx"
brew "postgis"
brew "postgresql@14", restart_service: :changed
brew "python-setuptools"
brew "reattach-to-user-namespace"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "shadowsocks-libev"
brew "sleepwatcher"
brew "ssh-copy-id"
brew "swiftformat"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "unzip"
brew "uv"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zsh"
brew "heroku/brew/heroku"
brew "qmk/qmk/qmk"
cask "anki"
cask "bitwarden"
cask "cursor"
cask "cursor-cli"
cask "dash"
cask "dropbox"
cask "flux-app"
cask "imageoptim"
cask "iterm2"
cask "keybase"
cask "keymapp"
cask "lm-studio"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "moom"
cask "ngrok"
cask "postman"
cask "quicklook-json"
cask "rapidapi"
cask "sourcetree"
cask "squirrel-app"
cask "transmission"
cask "vlc"
cask "vscodium"
cask "zed"
cask "zen"
vscode "continue.continue"
vscode "eamodio.gitlens"
vscode "elixir-lsp.elixir-ls"
vscode "rooveterinaryinc.roo-cline"
vscode "victorbjorklund.phoenix"
vscode "vscodevim.vim"
