# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Official Amazon AWS command-line interface
brew "awscli"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl", link: true
# Load/unload environment variables based on $PWD
brew "direnv"
# Terminal visual disk space navigator
brew "diskonaut"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Foreman in Go for Procfile-based application management
brew "forego"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GNU awk utility
brew "gawk"
# New GNU portable threads library
brew "npth"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generic library support script
brew "libtool"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Client library for huggingface.co hub
brew "hf"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# GUI for vim, made for macOS
brew "macvim"
# OCaml package manager
brew "opam"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# Open-source vector similarity search for Postgres
brew "pgvector"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Object-relational database system
brew "postgresql@18", restart_service: :changed, link: true
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Libev port of shadowsocks
brew "shadowsocks-libev"
# Work with remote images registries
brew "skopeo"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Postgres development platform
brew "supabase"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Flash ZSA keyboards from your terminal
brew "zapp"
# UNIX shell (command interpreter)
brew "zsh"
# Memory training application
cask "anki"
# Desktop password and login vault
cask "bitwarden"
# Productivity platform for tasks, docs, goals, and chat
cask "clickup"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Write, edit, and chat about your code with AI
cask "cursor"
# Command-line agent for Cursor
cask "cursor-cli"
# API documentation browser and code snippet manager
cask "dash"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Screen colour temperature controller
cask "flux-app"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# ZSA keyboard firmware flasher
cask "keymapp"
# Discover, download, and run local LLMs
cask "lm-studio"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Graphical client for Git version control
cask "sourcetree"
# Rime input method engine
cask "squirrel-app"
# Open-source BitTorrent client
cask "transmission"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
vscode "continue.continue"
vscode "eamodio.gitlens"
vscode "elixir-lsp.elixir-ls"
vscode "rooveterinaryinc.roo-cline"
vscode "victorbjorklund.phoenix"
vscode "vscodevim.vim"
uv "qmk", with: ["pip"]
npm "corepack"
