tap "aws/tap"
tap "gigalixir/brew"
tap "hamler-lang/hamler"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "autoconf"
brew "avrdude"
brew "gdbm"
brew "readline"
brew "awscli"
brew "bootloadhid"
brew "gettext"
brew "libffi"
brew "glib"
brew "carthage"
brew "clang-format"
brew "coreutils"
brew "ctags"
brew "dfu-programmer"
brew "dfu-util"
brew "direnv"
brew "diskonaut"
brew "wxwidgets"
brew "exercism"
brew "fasd"
brew "fd"
brew "libtool"
brew "harfbuzz"
brew "ffmpeg"
brew "findutils"
brew "fswatch"
brew "gifsicle"
brew "gnu-sed"
brew "gnupg"
brew "pango"
brew "graphviz"
brew "grip"
brew "imagemagick"
brew "jq"
brew "just"
brew "libzip"
brew "nginx"
brew "plantuml"
brew "postgresql", restart_service: true
brew "postgresql@12"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "ssh-copy-id", link: true
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "unzip"
brew "youtube-dl"
brew "zsh"
brew "gigalixir/brew/gigalixir"
brew "hamler-lang/hamler/hamler"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
brew "qmk/qmk/qmk"
cask "android-studio"
cask "anki"
cask "bitwarden"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "google-cloud-sdk"
cask "imageoptim"
cask "iterm2"
cask "macvim"
cask "mongodb-compass"
cask "moom"
cask "ngrok"
cask "postico"
cask "postman"
cask "quicklook-json"
cask "sourcetree"
cask "squirrel"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
